RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_pwr.h
/* Private macros ------------------------------------------------------------*/

/** @addtogroup PWR_Private_Macros PWR Private Macros
  * @{
  */
/* Wake up pins check macro */
#define IS_PWR_WAKEUP_PIN(PIN)          \
  (((PIN) == PWR_WAKEUP_PIN1_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN1_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN1_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN2_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN2_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN2_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN3_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN3_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN3_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN4_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN4_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN4_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN5_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN5_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN5_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN6_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN6_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN6_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN6_HIGH_3)  ||\
   ((PIN) == PWR_WAKEUP_PIN7_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN7_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN7_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN7_HIGH_3)  ||\
   ((PIN) == PWR_WAKEUP_PIN8_HIGH_0)  ||\
   ((PIN) == PWR_WAKEUP_PIN8_HIGH_1)  ||\
   ((PIN) == PWR_WAKEUP_PIN8_HIGH_2)  ||\
   ((PIN) == PWR_WAKEUP_PIN8_HIGH_3)  ||\
   ((PIN) == PWR_WAKEUP_PIN1_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN1_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN1_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN2_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN2_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN2_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN3_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN3_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN3_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN4_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN4_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN4_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN5_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN5_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN5_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN6_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN6_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN6_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN6_LOW_3)   ||\
   ((PIN) == PWR_WAKEUP_PIN7_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN7_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN7_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN7_LOW_3)   ||\
   ((PIN) == PWR_WAKEUP_PIN8_LOW_0)   ||\
   ((PIN) == PWR_WAKEUP_PIN8_LOW_1)   ||\
   ((PIN) == PWR_WAKEUP_PIN8_LOW_2)   ||\
   ((PIN) == PWR_WAKEUP_PIN8_LOW_3)   ||\
   ((PIN) == PWR_WAKEUP_PIN1)         ||\
   ((PIN) == PWR_WAKEUP_PIN2)         ||\
   ((PIN) == PWR_WAKEUP_PIN3)         ||\
   ((PIN) == PWR_WAKEUP_PIN4)         ||\
   ((PIN) == PWR_WAKEUP_PIN5)         ||\
   ((PIN) == PWR_WAKEUP_PIN6)         ||\
   ((PIN) == PWR_WAKEUP_PIN7)         ||\
   ((PIN) == PWR_WAKEUP_PIN8))

/* PVD level check macro */
#define IS_PWR_PVD_LEVEL(LEVEL)                                 \
  (((LEVEL) == PWR_PVDLEVEL_0) || ((LEVEL) == PWR_PVDLEVEL_1) ||\
   ((LEVEL) == PWR_PVDLEVEL_2) || ((LEVEL) == PWR_PVDLEVEL_3) ||\
   ((LEVEL) == PWR_PVDLEVEL_4) || ((LEVEL) == PWR_PVDLEVEL_5) ||\
   ((LEVEL) == PWR_PVDLEVEL_6) || ((LEVEL) == PWR_PVDLEVEL_7))

/* PVD mode check macro */
#define IS_PWR_PVD_MODE(MODE)                      \
  (((MODE) == PWR_PVD_MODE_NORMAL)               ||\
   ((MODE) == PWR_PVD_MODE_IT_RISING)            ||\
   ((MODE) == PWR_PVD_MODE_IT_FALLING)           ||\
   ((MODE) == PWR_PVD_MODE_IT_RISING_FALLING)    ||\
   ((MODE) == PWR_PVD_MODE_EVENT_RISING)         ||\
   ((MODE) == PWR_PVD_MODE_EVENT_FALLING)        ||\
   ((MODE) == PWR_PVD_MODE_EVENT_RISING_FALLING))

/* Sleep mode entry check macro */
#define IS_PWR_SLEEP_ENTRY(ENTRY) \
  (((ENTRY) == PWR_SLEEPENTRY_WFI) || ((ENTRY) == PWR_SLEEPENTRY_WFE))

/* Stop mode entry check macro */
#define IS_PWR_STOP_ENTRY(ENTRY) \
  (((ENTRY) == PWR_STOPENTRY_WFI) || ((ENTRY) == PWR_STOPENTRY_WFE))

/* PWR items check macro */
#define IS_PWR_ITEMS_ATTRIBUTES(ITEM) \
  ((((ITEM) & (~PWR_ALL)) == 0U) && ((ITEM) != 0U))

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* PWR attribute check macro (Secure) */
#define IS_PWR_ATTRIBUTES(ATTRIBUTES) \
  ((((~(((ATTRIBUTES) & 0xF0U) >> 4U)) & ((ATTRIBUTES) & 0x0FU)) == 0U) && (((ATTRIBUTES) & 0xFFFFFFCCU) == 0U))
#else
/* PWR attribute check macro (NSecure) */
#define IS_PWR_ATTRIBUTES(ATTRIBUTES) \
  (((ATTRIBUTES) == PWR_NSEC_NPRIV) || ((ATTRIBUTES) == PWR_NSEC_PRIV))
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/* Include PWR HAL Extended module */
#include "stm32u5xx_hal_pwr_ex.h"

/* Exported functions --------------------------------------------------------*/

/** @addtogroup PWR_Exported_Functions PWR Exported Functions
  * @{
  */

/** @addtogroup PWR_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
void HAL_PWR_DeInit(void);
void HAL_PWR_EnableBkUpAccess(void);
void HAL_PWR_DisableBkUpAccess(void);
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group2
  * @{
  */
/* Programmable voltage detector functions ************************************/
HAL_StatusTypeDef HAL_PWR_ConfigPVD(PWR_PVDTypeDef *pConfigPVD);
void              HAL_PWR_EnablePVD(void);
void              HAL_PWR_DisablePVD(void);

/* Wake up pins configuration functions ***************************************/
void HAL_PWR_EnableWakeUpPin(uint32_t WakeUpPin);
void HAL_PWR_DisableWakeUpPin(uint32_t WakeUpPin);

/* Low power modes configuration functions ************************************/
void HAL_PWR_EnterSLEEPMode(uint32_t Regulator, uint8_t SleepEntry);
void HAL_PWR_EnterSTOPMode(uint32_t Regulator, uint8_t StopEntry);
void HAL_PWR_EnterSTANDBYMode(void);

/* Sleep on exit and sev on pending configuration functions *******************/
void HAL_PWR_EnableSleepOnExit(void);
void HAL_PWR_DisableSleepOnExit(void);
void HAL_PWR_EnableSEVOnPend(void);
void HAL_PWR_DisableSEVOnPend(void);

/* Interrupt handler functions ************************************************/
void HAL_PWR_PVD_IRQHandler(void);
void HAL_PWR_PVDCallback(void);
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group3
  * @{
  */
/* Privileges and security configuration functions ****************************/
void              HAL_PWR_ConfigAttributes(uint32_t Item, uint32_t Attributes);
HAL_StatusTypeDef HAL_PWR_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5xx_HAL_PWR_H */
